Repository: pwsafe/pwsafe
Catalog: Misc/I18N/ru/omegat_help/omegat/project_save.tmx
Source language: en_us
Languages: ru_ru

source: The default is to copy the entry's password to the clipboard.
ru_ru: Действием по умолчанию является копирование пароля в буфер обмена.

source: The default list of symbols to be used when generating a password with symbols.
ru_ru: Набор символов по умолчанию для создания пароля.

source: The default, 10mS, should be fine for most systems.
ru_ru: Значение по умолчанию (10 мс) подходит для большинства систем.

source: The display of XML files is specified by pwsafe.xsl - an eXtensible Stylesheet Language file.
ru_ru: Отображение XML-файлов в браузере описывается в стилевом файле pwsafe.xsl (XSL — eXtensible Stylesheet Language).

source: The dollar ('$') sign is used to indicate a variable.
ru_ru: Символ доллара («$») используется для указания переменных.

source: The dragbar will disable ("grey out") icons for fields that are empty for a given entry.
ru_ru: Для незаполненных полей элемента, соответствующие значки на панели «Dragbar» заблокированы (серые).

source: The dragbar will disable ("grey out") icons for fields that are empty for the selected entry.
ru_ru: Для незаполненных полей элемента, соответствующие значки на панели «Dragbar» заблокированы (серые).

source: The encrypted file will have the same name as the original file, with ".PSF" appended to it.
ru_ru: Имя зашифрованного файла останется тем же, а в качестве расширения добавляется «.psf».

source: The entries will be displayed normally, with possible "unknown" values in fields that were unsupported in previous versions (e.g., the creation date of an entry).
ru_ru: Элементы будут отображаться как обычно, за исключением того, что некоторые поля могут быть не заполнены, так как они отсутствовали в ранних версиях (например, дата создания элемента).

source: The example command line execution of these processors assume:
ru_ru: Приведённые в примерах командные строки предполагают, что

source: The export of sensitive data effectively bypasses the security of the Password Safe program.
ru_ru: Экспорт важной информации позволяет обойти меры защиты, предоставляемые Password Safe.

source: The external editor you specify in this field will be used when right clicking on an entry's Notes field and selecting to edit the field using an external editor.
ru_ru: Указанный здесь внешний редактор будет доступен через контекстное меню при вставке/редактировании элемента.

source: The field separator used in the text file being imported and a default group name to import the new entries into can be configured before processing the file.
ru_ru: Разделитель полей используется для выделения полей в текстовых строках. Также можно указать имя группы, в которую будут помещены все импортированные элементы.

source: The fields must be separated with the field separator specified for the data in the Import Text dialog box.
ru_ru: Поля должны быть разделены определённым символом, который указывается в диалоге импорта.

source: The first character must be alphanumeric.
ru_ru: Начинаться с буквы или цифры.

source: The first pair should be prefixed by a "?" and any additional pairs should be prefixed by an ampersand (&).
ru_ru: Перед первой парой должен стоять знак «?», последующие пары отделяются символом «&».

source: The first row is the specified database followed by general information about it (the same as shown in the Properties dialog from the File menu).
ru_ru: В первом столбце указывается имя контейнера, в остальных — основная информация о контейнере (та же, что отображается при открытии пункта меню «Файл→Свойства»).

source: The first value has 4 digits, all other 3.
ru_ru: Первое из них состоит из 4-х цифр, остальные — из 3-х.

source: The following KeePass V2 Auto-type special codes (see http://keepass.info/help/base/autotype.html) are translated as follows.
ru_ru: Ниже описаны преобразования кодов автонабора KeePass V2 (см. http://keepass.info/help/base/autotype.html) в коды Password Safe.

source: The following KeePass V2 Placeholders (see http://keepass.info/help/base/placeholders.html) are translated as follows.
ru_ru: Ниже описаны ключевые последовательности подстановок KeePass V2 (см. http://keepass.info/help/base/placeholders.html) в коды Password Safe.

source: The following Run Command will cause the Putty program to connect to myHost giving the entry's username and password:
ru_ru: Для подключения к myHost с именем пользователя и пароля из текущего элемента через PuTTY, нужно указать в поле «Выполнить» следующее значение:

source: The following bits of information are associated with each password entry:
ru_ru: Ниже приведено описание полей, связанных с каждым элементом:

source: The following dialog box will appear:
ru_ru: Будет отображён следующий диалог:

source: The following dialog box will be displayed:
ru_ru: Будет отображён следующий диалог:

source: The following dialog is shown (replacing the previous tab in the "Manage → Options..." function).
ru_ru: Будет отображён следующий диалог (заменяет вкладку Управление→Настройки→Политика создания паролей, использованную в предыдущих версиях)

source: The following dialog is shown.
ru_ru: Будет отображён следующий диалог:

source: The following examples should make this clear.
ru_ru: Ниже приведены поясняющие примеры.

source: The following fields are converted to the Password Safe equivalents:
ru_ru: Перечисленные поля преобразуются в соответствующие поля Password Safe.

source: The following fields are currently ignored:
ru_ru: Следующие поля игнорируются:

source: The following images are used to show the type of entry in the Tree and List views.
ru_ru: Ниже приведены значки, используемые для отображения типов элементов в древовидном и простом списках.

source: The following notes describe the way URLs are handled in more detail:
ru_ru: Особенности работы со ссылками:

source: The following table shows the conversion of these to the Password Save equivalent XML element.
ru_ru: В таблице указаны преобразования элементов этого разделов при импорте в Password Safe.

source: The following tables describes the configuration items.
ru_ru: Таблица описывает настраиваемые параметры.

source: The following values for Double Click Action are available:
ru_ru: Допустимы следующие значения для действия по двойному клику:

source: The following values for Double Click Action are availble:
ru_ru: Допустимы следующие значения для действия по двойному клику:

source: The following variables are currently recognised:
ru_ru: В настоящий момент распознаются следующие переменные:

source: The following window will be displayed:
ru_ru: Будет отображён следующий диалог:

source: The format is as follows ('$autotype' can replace '$a' in the following examples):
ru_ru: Используется следующий формат (в указанных примерах «$a» можно заменить на «$autotype»):

source: The format is the "name" of the referred-to entry enclosed in square brackets.
ru_ru: Для этого в поле пароля псевдонима нужно указать «имя» исходного элемента в квадратных скобках.

source: The format of the command depends on whether you use the Java or .Net version of Saxon-HE and/or Kernow.
ru_ru: Формат команды зависит от того, какая используется версия Saxon-HE и/или Kernow (Java или .Net).

source: The formats that Password Safe supports are:
ru_ru: Password Safe поддерживает следующие форматы:

source: The former are kept in the database, encrypted with the same key as the user's data.
ru_ru: Первые хранятся в контейнере и шифруются с помощью того же ключа, что и остальные данные.

source: The group containing this entry only.
ru_ru: Только имя группы, содержащей текущий элемент.

source: The group containing this entry.
ru_ru: Имя группы, содержащей текущий элемент.

source: The hardest part is setting up the aliases, as described below.
ru_ru: Самая сложная часть — это определение псевдонимов.

source: The home page is maintained by Brad Chance - Thanks Brad!
ru_ru: Домашняя страница поддерживается Брэдом Ченсом (Brad Chance). Спасибо, Брэд!

source: The hour using a 24-hour clock.
ru_ru: Час в 24-часовом формате.

source: The icon in the system tray indicates whether the password database is locked () or unlocked ().
ru_ru: Значок в области уведомлений показывает, является ли контейнер заблокированным () или открытым ().

source: The index value 'n' can be preceded by '+' or '-' e.g. [-2] or [2] or [+2].
ru_ru: Значение индекса «n» может предваряться символом «+» или «-», например, [-2], [2] или [+2].

source: The initial values are taken from the current database's default password policy.
ru_ru: Начальные значения параметров берутся из политики по умолчанию для текущего контейнера.

source: The input KeePass V1 or V2 XML file is: KeePassV1.xml or KeePassV2.xml
ru_ru: Имя входного XML-файла KeePass V1 или V2: KeePassV1.xml или KeePassV2.xml.

source: The key with the Alt and Ctrl keys
ru_ru: Клавиша нажимается вместе с Alt и Ctrl

source: The key with the Alt and Shift keys
ru_ru: Клавиша нажимается вместе с Alt и Shift

source: The key with the Alt key
ru_ru: Клавиша нажимается вместе с Alt

source: The key with the Alt, Ctrl and Shift keys
ru_ru: Клавиша нажимается вместе с Alt, Ctrl и Shift

source: The key with the Ctrl and Shift keys
ru_ru: Клавиша нажимается вместе с Ctrl и Shift

source: The key with the Ctrl key
ru_ru: Клавиша нажимается вместе с Ctrl

source: The key with the Shift key
ru_ru: Клавиша нажимается вместе с Shift

source: The keyboard shortcut will be removed from an entry if it is already assigned to another entry in the database, in the following cases:
ru_ru: Комбинация клавиш отвязывается от элемента, если она уже назначена другому элементу и

source: The label will flash green to show that the data has been copied.
ru_ru: После копирования в буфер метка моргнёт зелёным цветом.

source: The last action will be reset.
ru_ru: Отмена последнего действия.

source: The last action will be reversed.
ru_ru: Отмена последнего действия.

source: The last sort direction in List View (ascending [true] or descending [false])
ru_ru: Направление сортировки при просмотре в виде списка (по возрастанию [true] или убыванию [false])

source: The last sort direction in List View (ascending or descending)
ru_ru: Направление сортировки при просмотре в виде списка (по возрастанию или убыванию)

source: The last undone action(s) will be executed again.
ru_ru: Последнее отменённое действие (действия) будет выполнено снова.

source: The latest program updates, documentation, and news can be located at http://pwsafe.org.
ru_ru: Последние обновления, документация и новости расположены на сайте https://pwsafe.org.

source: The latest program updates, documentation, and news can be located at https://pwsafe.org.
ru_ru: Последние обновления, документация и новости расположены на сайте https://pwsafe.org.

source: The length, letters, numbers, and special characters used to generate a password are easily controlled through the Password Policy dialog in the Option menu."
ru_ru: Длина, буквы, цифры и специальные символы, используемые для для создания паролей, настраиваются на вкладке «Сервис→Настройки→Политика создания паролей»"

source: The letters used when use only easy-to-read characters is checked are: a b c d e f g h i j k m n o p q r s t u v w x y z and A B C D E F G H J K L M N P Q R T U V W X Y, and the digits are limited to 3 4 6 7 8 9.
ru_ru: При установленном флажке Только удобочитаемые символы набор букв сокращается до: a b c d e f g h i j k m n o p q r s t u v w x y z и A B C D E F G H J K L M N P Q R T U V W X Y, а набор цифр ограничивается 3 4 6 7 8 9.

source: The links that follow lead to various pages on the SourceForge web site related to the Password Safe project:
ru_ru: Ниже указаны ссылки на различные страницы сайта SourceForge, связанные с проектом Password Safe:

source: The list of recently opened files may be cleared by selecting "Clear Recent Safe List"
ru_ru: Список недавно использованных контейнеров можно очистить нажав на пункт меню Очистить список ранее использованных контейнеров.

source: The main difference between Merge and Synchronize is that during a Merge, all elements of the merging database will be taken to the currently opened database.
ru_ru: Основное различие между слиянием и синхронизацией состоит в том, что во время слияния все элементы из выбранного контейнера переносятся в открытый.

source: The master password can be entered using the physical or virtual keyboard.
ru_ru: Для ввода пароля можно использовать физическую или экранную клавиатуру.

source: The migration function will move the current user's settings (associated with the current PC) from the configuration file to the new location.
ru_ru: Данная функция производит перенос настроек текущего пользователя (связанных с данным компьютером) в файл по новому пути.

source: The minutes
ru_ru: Минуты в двузначном формате

source: The month; e.g. 01 = January, 02 = February etc.
ru_ru: Месяц в двузначном виде: 01 = январь, 02 = февраль, и т. д.

source: The name can be one of the following strings:
ru_ru: В качестве имени в паре может быть указано одно из следующих значений:

source: The name of a password policy can be at most 255 characters long.
ru_ru: Длина имени политики не должна превышать 255 символов.

source: The name of the report file is fixed and dependent on the function that created it.
ru_ru: Отчёт имеет фиксированное имя, зависящее от его типа.

source: The name of the report file is fixed and depends on the function that created it.
ru_ru: Отчёт имеет фиксированное имя, зависящее от его типа.

source: The names and location of the backup copies are defined in the following fields, as well as how many copies back should be kept.
ru_ru: Имя файла, его расположение и количество сохраняемых копий указаны в следующих полях.

source: The names and location of the backup copies are defined in the following fields, as well as how many previous copies should be kept.
ru_ru: Имя файла, его расположение и количество сохраняемых копий указаны в следующих полях.

source: The names and location of the backup copies are defined in the following fields, as well as how many previous copies will be kept.
ru_ru: Имя файла, его расположение и количество сохраняемых копий указаны в следующих полях.

source: The names of the backup files consist of Base (by default, the name of the database without the .psafe3 extension), and Suffix (none, a running count, or the date/time of the backup).
ru_ru: Имя для резервной копии состоит из начала (по умолчанию это имя файла контейнера без расширения «.psafe3»), и суффикса (может быть пустыми или содержать номер/дату/время резервного копирования).

source: The names of the backup files consist of a Base (by default, the name of the database without the .psafe3 extension), and a Suffix (none, a running count, or the date/time of the backup).
ru_ru: Имя для резервной копии состоит из начала (по умолчанию это имя файла контейнера без расширения «.psafe3»), и суффикса (может быть пустыми или содержать номер/дату/время резервного копирования).

source: The normal processing is to place each Notes line on a separate line in the exported text field.
ru_ru: Обычно, каждая строка заметок записывается в отдельной строке.

source: The number of matching entries (if any) will be displayed in the right side of the toolbar, and the first matching entry will be selected and emphasized.
ru_ru: Количество найденных элементов (если такие есть) будет отображено в правой части панели, а первый подходящий элемент будет выделен и получит фокус.

source: The number of recent files that Password Safe will keep may be configured via the "Manage → Options → System" tab, where you may also configure if you prefer to see the recent files in the File menu, or as a submenu.
ru_ru: Количество запоминаемых контейнеров настраивается на вкладке Сервис→Настройки→Система. Также там можно настроить размещение списка недавно используемых контейнеров внутри меню «Файл», а не в его подменю.

source: The number of recent files that Password Safe will keep may be configured via the Manage->Options->System dialog box, where you may also configure if you prefer to see the recent files in the File menu, or as a submenu.
ru_ru: Количество запоминаемых контейнеров настраивается на вкладке Система диалога «Управление»→«Настройки». Также там можно настроить отображение списка недавно используемых контейнеров внутри меню «Файл», а не в его подменю.

source: The only exception to this is the Use hexadecimal digits only check box.
ru_ru: Единственное исключение — настройка Только шестнадцатеричные цифры (0–9, a–f).

source: The output Password Safe XML file will be: PWS.xml
ru_ru: Имя выходного XML-файла Password Safe: PWS.xml.

source: The padlock graphic in the uper left corner indicates whether or not the "Secure Desktop" feature is enabled.
ru_ru: Изображение замка в левом верхнем углу показывает, включён ли «Защищённый рабочий стол».

source: The padlock image on the right indicates if Secure Desktop is enabled for entering the master passphrase.
ru_ru: Изображение замка справа показывает, будет ли использован «Защищённый рабочий стол» для ввода мастер-пароля.

source: The password in the clipboard can then be used by some other application.
ru_ru: Пароль из буфера обмена может быть использован в других приложениях.

source: The password requested is that of the currently open database.
ru_ru: Запрашиваемый пароль относится к открытому контейнеру.

source: The password requested is that of this new database and not the currently open database.
ru_ru: Запрашиваемый пароль относится к этому контейнеру, а не к уже открытому.

source: The programs listed below may be used to process the exported XML file with one of these XSLT files to produce a Password Safe compatible XML file that can then be imported to Password Safe V3.26 or later.
ru_ru: Указанны ниже программы могут быть использованы для обработки экспортированных XML-файлов с помощью XSLT-шаблонов. Полученные в результате преобразования файлы совместимы с импортируемыми Password Safe XML-файлами (для Password Safe V3.26 или новее).

source: The properties of the file msxsl.exe state that it is V1.1.0.1 and dated 2001, although the web site states that it is V2.0 and dated 19 September 2004.
ru_ru: В свойствах файла msxsl.exe указана версия V1.1.0.1 и дата 2001 г., хотя на web-сайте указана версия V2.0 с датой 19 сентября 2004 г.

source: The restored database is not "saved" with the standard Password Safe database extension (.psafe3) until you have selected Save or Save As from the file menu.
ru_ru: Чтобы восстановленный контейнер сохранился со стандартным для Password Safe расширением «.psafe3», выберите в меню Файл пункт Сохранить или Сохранить как.

source: The same ID can't be assigned to two open databases at the same time.
ru_ru: Один и тот же идентификатор не может быть назначен двум одновременно открытым контейнерам.

source: The same is true for all the Wizard functions, although the values are independent:
ru_ru: То же правило применимо для всех мастеров, но соответствующие списки независимы:

source: The scope of the menu item shortcuts is for all databases opened by a given user on a particular PC and can be customised by that user (Manage → Options, Shortcuts tab) and may change according to the user selected application language e.g. English, German etc.
ru_ru: Область действия горячих клавиш для пунктов меню распространяется на все контейнеры, открываемые на данном ПК. Значения по умолчанию зависят от выбранного языка. Ручная настройка горячих клавиш для пунктов меню производится на вкладке Сервис→Настройки→Комбинации клавиш.

source: The seconds
ru_ru: Секунды в двузначном формате

source: The selected Failsafe Backup file will be opened instead of the currently selected database.
ru_ru: Вместо текущего контейнера будет открыта выбранная аварийная резервная копия.

source: The selected entry or all entries within the selected group will be exported as a new Password Safe database.
ru_ru: Выбранный элемент (все элементы выбранной группы) экспортируются в новый контейнер Password Safe.

source: The selected entry or all entries within the selected group will be exported as plain text.
ru_ru: Выбранный элемент (все элементы выбранной группы) экспортируются в текстовый файл.

source: The selected entry or all entries within the selected group will be exported in XML format.
ru_ru: Выбранный элемент (все элементы выбранной группы) экспортируются в файл формата XML.

source: The selected entry or group of entries will be protected.
ru_ru: Выбранный элемент или группа элементов будут защищены.

source: The selected entry will be exported as plain text.
ru_ru: Экспорт выбранного элемента в текстовый файл.

source: The selected entry will be exported in XML format.
ru_ru: Экспорт выбранного элемента в XML формат.

source: The sequence may be changed when the option is checked.
ru_ru: Комбинация клавиш может быть изменена при установке флажка для данной настройки.

source: The setting of the slider determines how much processing is required to open and save a Password Safe database.
ru_ru: Положение ползунка определяет количество вычислительных ресурсов, требуемых для открытия и сохранения контейнера Password Safe.

source: The short form of the day of the week; e.g. Mon = Monday, Tue = Tuesday, etc.
ru_ru: Краткое наименование дня недели (язык сокращения для дня недели зависит от текущей локали): Mon = Monday, Tue = Tuesday, Вск = воскресенье, Пнд. = понедельник и т. д.

source: The short form of the month; e.g. Jan = January, Feb = February etc.
ru_ru: Краткое наименования месяца (язык сокращения для месяца зависит от текущей локали): Jan = January, Feb = February или Янв = январь, Фев = февраль и т. д.

source: The shortcuts will be stored in your preference file, and will be available the next time you start Password Safe.
ru_ru: Комбинации клавиш сохраняются в файле настроек и будут доступны при последующих запусках Password Safe.

source: The simplect method of ensuring a new group remains is to create a new entry and type in the new group path in the group field (groups are separated by periods ('.')).
ru_ru: Для того, чтобы новая группа гарантированно сохранилась, можно создать новый элемент и набрать требуемое имя в поле «Группа» (вложенные группы разделяются точкой «.»).

source: The simplest method of ensuring a new group remains is to create a new entry and type in the new group path in the group field (groups are separated by periods ('.')).
ru_ru: Для того, чтобы новая группа гарантированно сохранилась, можно создать новый элемент и набрать требуемое имя в поле «Группа» (вложенные группы разделяются точкой «.»).

source: The simplest way to use this is to just enter the text you're looking for, and then press Enter or click on the magnifying glass icon to the right of the text field.
ru_ru: Для начала поиска достаточно ввести нужный текст и нажать Enter или щёлкнуть по значку с лупой, расположенному справа от поля ввода.

source: The slider sets the number of iterations of the stretching, between 2048 and 222.
ru_ru: Ползунок задаёт количество итераций для алгоритма от 2048 до 222.

source: The special control code between the curley brackets is not case sensitive and is unaffected by the presence of the "\z" AutoType field.
ru_ru: Управляющие последовательности в фигурных скобка регистронезависимы, а их обработка не зависит от наличия в строке автонабора последовательности «\z».

source: The standard characters should work on any other keyboard with Latin characters.
ru_ru: Стандартные комбинации клавиш должны работать на любой другой клавиатуре с латинскими символами.
